{
    "header": {
        "about": "About"
    },

    "home": {
        "predictionSection": {
            "tittle": "Energy Consumption Forecast",
            "p1": "The forecast chart displays a linear regression that allows the user to select the country, the type of energy data, and the number of years to project consumption from 2022 onwards.",
            "p2": "Linear regression is a statistical technique used to predict the future behavior of a variable based on historical data. In the case of the presented work, the model identifies a relationship between time (x-axis) and the type of data (y-axis) to provide estimates of how consumption may evolve in the coming years.",
            "chart": {
                "xAxis": "Prediction"
            },
            "transcript": {
                "title":  "Prediction chart transcript",
                "nodata": "Insufficient data for this country with this type of energy.",
                "close": "Close"
            }
        },
        "predictionSelect": {
            "error1": "Fill in all fields!",
            "error2": "The number of years must be greater than 0.",
            "error3": "Insufficient data for this country with this type of energy.",
            "success": "Prediction made successfully!",
            "placeholder1": "Select the country",
            "placeholder2": "How many years?",
            "placeholder3": "Number of years for the prediction",
            "placeholder4": "Select the type of energy",
            "button": "Process",
            "button.loading": "Processing..."
        },
        "top10": {
            "renewables": {
                "title": "Top 10 countries with the highest renewable energy production",
                "p1": "Renewable energy is an energy source that is obtained from natural resources that are naturally replenished, such as sunlight, wind, rain, tides, waves, and geothermal heat.",
                "p2": "Renewable energy is an alternative to non-renewable energy, which is obtained from finite resources, such as coal, oil, and natural gas.",
                "chart": {
                    "legend": "* Graph of the 10 countries that consume the most renewable energy. (TWh)"
                }
            },
            "nonRenewables": {
                "title": "Top 10 countries with the highest non-renewable energy production",
                "p1": "Non-renewable energy is an energy source that is obtained from finite resources, such as coal, oil, and natural gas.",
                "p2": "Non-renewable energy is an alternative to renewable energy, which is obtained from natural resources that are naturally replenished, such as sunlight, wind, rain, tides, waves, and geothermal heat.",
                "chart": {
                    "legend": "* Graph of the 10 countries that consume the most non-renewable energy. (TWh)"
                }
            },
            "charts": {
                "wind_consumption": "Wind",
                "solar_consumption": "Solar",
                "hydro_consumption": "Hydroelectric",
                "other_renewable_consumption": "Others",
                "coal_consumption": "Coal",
                "oil_consumption": "Oil",
                "gas_consumption": "Natural Gas",
                "nuclear_consumption": "Nuclear"
            },
            "countries": {
                "China": "China",
                "United States": "United States",
                "Canada": "Canada",
                "Brazil": "Brazil",
                "Russia": "Russia",
                "Japan": "Japan",
                "Norway": "Norway",
                "India": "India",
                "France": "France",
                "Sweden": "Sweden",
                "Germany": "Germany",
                "United Kingdom": "United Kingdom",
                "Italy": "Italy"
            }
        }
    },

    "about": {
        "title1": "About the Work",
        "p1": "This work was developed by students from the Catholic University of Santos in the Computer Science program. The focus is on the analysis of energy data and the use of prediction and visualization tools to understand the behavior of global energy consumption.",
        "github": "GitHub Repository",
        "members": "Members",
        "tech": {
            "title": "Technologies Used",
            "p": "The project was developed using the following technologies:",
            "react": "JavaScript framework for developing the site interface.",
            "python": "Language used for data processing and prediction.",
            "pandas": "Python library for data manipulation.",
            "powerbi": "Tool for creating interactive dashboards.",
            "flask": "Used to create the API that processes the data.",
            "iframe": "Used to embed PowerBI dashboards into the website."
        },
        "stages": {
            "title": "Work Stages"
            
        }
    },

    
    "powerbi": {
        "graph1": {
            "title": "Graph 1: Line",
            "description": "Shows the evolution of the energy metric over the years for the selected country, with X-axis (years) and Y-axis (metric value)."
        },
        "graph2": {
            "title": "Graph 2: Bars",
            "description": "Displays the countries in descending order, comparing them by the selected metric."
        },
        "graph3": {
            "title": "Graph 3: Map Bubbles",
            "description": "Shows the global distribution of the selected metric, with the size of the bubbles indicating the magnitude for each country."
        },
        "graph4": {
            "title": "Graph 4: Doughnut",
            "description": "Displays the proportion of renewable versus non-renewable energy for the selected country."
        }
    },
      

    "footer": {
        "copy": "Website developed by students from Unisantos"
    }
}